// Задача  6
Console.WriteLine("Введите число a: ");
int a = int.Parse(Console.ReadLine());
if (a % 2 == 0)Console.WriteLine("это четное число");
else Console.WriteLine("это не четное число");